import time  # бібліотека роботи з часом

a = int(input('Введи, будь ласка, перше число: '))
print('Записую...')
time.sleep(5)  # таймер
b = int(input('А тепер введи друге число: '))
print('Секунду, нотую...')
time.sleep(5)
c = input('Введи дію: ')
print('Ага, я зрозумів...')
time.sleep(5)
print('Творю magic...')
time.sleep(2)
if c == "+":
    d = a + b
    print('Результат у мене вийшов ось такий: ', d)
elif c == '-':
    d = a - b
    print('Результат у мене вийшов ось такий: ', d)
elif c == "*":
    d = a * b
    print('Результат у мене вийшов ось такий: ', d)
elif c == "/":
    if b != 0:  # перевірка ділення на нуль
        d = a / b
        print('Результат у мене вийшов ось такий: ', d)
    else:
        print("Помилка! Ділення на нуль!")
else:
    print("Е ні, друже! Щось забагато ти від мене хочеш!")
